#include <iostream>

using namespace std;

int main(){
	
	//자료구조
	//데이터를 저장하는 방식
	//수많은 자료구조 중 데이터에 맞는 특성을 지닌 자료구조를 선택하는 것은
	//효율적인 알고리즘 작성에 반드시 필수
	
	/*
	1.선형 자료구조
	한 종류의 데이터가 선처럼 길게 나열된 자료구조
	모든 자료에 O(1)의 속도로 접근이 보장된다.
	-랜덤 접근 가능
	--배열 Array
	C언어에서 배열에 저장된 값들의 주소를 출력해보면 주소가 연속적으로 배치되어 있다.
	--해시 Hash
	O(1)의 시간 소요 <- 언제나 O(1) X
	"키" 값을 넣어 주소값을 얻고, 그 주소에 위치한 "버킷"에 저장된 데이터를 가져오는 방식을 사용한다.
	파이썬에서는 딕셔너리(Dictionary)라고 부른다.
	dict1 = {1:"하나","apple":"사과","리스트":[1,2,3]}
	
	--랜덤 접근 불가능
	모든 자료에 O(1)으로 접근이 보장되지 않는 자료구조들이다.
	--스택 Stack
	먼저 들어간 자료가 나중에 나오는 자료구조 -> "선입후출"
	나중에 들어간 자료가 먼저 나오는 자료구조 -> "후입선출"
	자료를 넣는 push()함수와 자료를 빼는 pop함수를 가진다.
	*/
	
	
	
	return 0;
}